src/OpenFOAM/OpenFOAM-7/test/multiphase/reactingTwoPhaseEulerFoam/populationBalanceModeling/drift/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type populationBalanceTwoPhaseSystem;

phases (air water);

populationBalances (bubbles);

air
{
    type            pureIsothermalPhaseModel;
    diameterModel   velocityGroup;
    velocityGroupCoeffs
    {
        populationBalance    bubbles;

        formFactor      1;

        sizeGroups
        (
            f0  {d  1.0000000   ; value 0.0000000   ;}
            f1  {d  1.0500000   ; value 0.0000000   ;}
            f2  {d  1.1000000   ; value 0.0000000   ;}
            f3  {d  1.1500000   ; value 0.0000000   ;}
            f4  {d  1.2000000   ; value 0.0000000   ;}
            f5  {d  1.2500000   ; value 0.0609671   ;}
            f6  {d  1.3000000   ; value 0.0741729   ;}
            f7  {d  1.3500000   ; value 0.0895739   ;}
            f8  {d  1.4000000   ; value 0.1074333   ;}
            f9  {d  1.4500000   ; value 0.1280343   ;}
            f10 {d  1.5000000   ; value 0.1516810   ;}
            f11 {d  1.5500000   ; value 0.1786995   ;}
            f12 {d  1.6000000   ; value 0.2094380   ;}
            f13 {d  1.6500000   ; value 0.0000000   ;}
            f14 {d  1.7000000   ; value 0.0000000   ;}
            f15 {d  1.7500000   ; value 0.0000000   ;}
            f16 {d  1.8000000   ; value 0.0000000   ;}
            f17 {d  1.8500000   ; value 0.0000000   ;}
            f18 {d  1.9000000   ; value 0.0000000   ;}
            f19 {d  1.9500000   ; value 0.0000000   ;}
            f20 {d  2.0000000   ; value 0.0000000   ;}
            f21 {d  2.0500000   ; value 0.0000000   ;}
            f22 {d  2.1000000   ; value 0.0000000   ;}
            f23 {d  2.1500000   ; value 0.0000000   ;}
            f24 {d  2.2000000   ; value 0.0000000   ;}
            f25 {d  2.2500000   ; value 0.0000000   ;}
            f26 {d  2.3000000   ; value 0.0000000   ;}
            f27 {d  2.3500000   ; value 0.0000000   ;}
            f28 {d  2.4000000   ; value 0.0000000   ;}
            f29 {d  2.4500000   ; value 0.0000000   ;}
            f30 {d  2.5000000   ; value 0.0000000   ;}
        );
    }

    residualAlpha   1e-6;
}

water
{
    type            pureIsothermalPhaseModel;
    diameterModel   constant;
    constantCoeffs
    {
        d               1e-4;
    }

    residualAlpha   1e-6;
}

populationBalanceCoeffs
{
    bubbles
    {
        continuousPhase water;

        coalescenceModels
        ();

        binaryBreakupModels
        ();

        breakupModels
        ();

        driftModels
        (
            constant{}
        );

        nucleationModels
        ();
    }
}

blending
{
    default
    {
        type            none;
        continuousPhase water;
    }
}

surfaceTension
();

interfaceCompression
();

aspectRatio
();

drag
(
    (air in water)
    {
        type            SchillerNaumann;
        residualRe      1e-3;
        swarmCorrection
        {
            type        none;
        }
    }
);

virtualMass
();

heatTransfer
();

phaseTransfer
();

lift
();

wallLubrication
();

turbulentDispersion
();

// Minimum allowable pressure
pMin            10000;


// ************************************************************************* //
